'use client';

import { Button } from '@/components/ui/button';
import { Card } from '@/components/ui/card';
import { Checkbox } from '@/components/ui/checkbox';
import { Textarea } from '@/components/ui/textarea';
import { HOME_URL, LOGIN_USER_URL, REGISTER_URL } from '@/constants/routes';
import { useRouter } from 'next/navigation';
import { useState } from 'react';
import { AppLogo } from '@/components/app-logo';

const PolicyForm = () => {
  const firstPolicy = `이용약관
한국식품산업클러스터진흥원은 사용자의 소중한 정보 보호를 위해 관련 법률을 준수하고 있습니다.
한국식품산업클러스터진흥원 이용약관
제1조(목적)
본 약관은 한국식품산업클러스터진흥원 비즈니스 플랫폼(이하"한국식품산업클러스터진흥원"라 한다)가 제공하는 모든 서비스(이하"서비스")의 이용조건 및 절차, 이용자와 당 사이트의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
 
제2조(용어의 정의)
본 약관에서 사용하는 용어의 정의는 다음과 같습니다.  1."서비스"라 함은 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 "회원"이 이용할 수 있는 한국식품산업클러스터진흥원의 서비스를 의미합니다.2."회원"이라 함은 한국식품산업클러스터진흥원의"서비스"에 접속하여 이 약관에 따라"한국식품산업클러스터진흥원"와 이용계약을 체결하고"한국식품산업클러스터진흥원"가 제공하는"서비스"를 이용하는 고객 및 바이어를 말합니다.3."아이디(ID)"라 함은"회원"의 식별과"서비스" 이용을 위하여"회원"이 정하고"한국식품산업클러스터진흥원"가 승인하는 문자와 숫자의 조합을 의미합니다.4."비밀번호"라 함은"회원"이 부여 받은"아이디와 일치되는"회원"임을 확인하고 비밀보호를 위해"회원" 자신이 정한 문자 또는 숫자의 조합을 의미합니다.5."게시물"이라 함은"회원"이"서비스"를 이용함에 있어"서비스상"에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상  및 데이터 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다.
 
제3조(약관의 게시와 개정)
1."한국식품산업클러스터진흥원"는 이 약관의 내용을"회원"이 쉽게 알 수 있도록 서비스 메인 화면 하단에 고정 게시합니다.2."한국식품산업클러스터진흥원"은"약관의규제에관한법률",
"정보통신망이용촉진및정보보호등에관한법률(이하"정보통신망법")" 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.3."한국식품산업클러스터진흥원"이 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자30일 전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리한 약관의 개정의 경우에는 공지 외에 일정기간 서비스내 전자우편, 전자쪽지, 로그인시 동의 창 등의 전자적 수단을 통해 따로 명확히 통지하도록 합니다.4.“한국식품산업클러스터진흥원”이 전항에 따라 개정약관을 공지 또는 통지하면서 회원에게30일 기간 내에 의사표시를 하지 않으면 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.5. 회원이 개정약관의 적용에 동의하지 않는 경우“한국식품산업클러스터진흥원”은 개정 약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는“한국식품산업클러스터진흥원”은 이용계약을 해지할 수 있습니다.
 
제4 조(이용계약 체결)
1. 이용계약은"회원"이 되고자 하는 자(이하"가입신청자")가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고"한국식품산업클러스터진흥원"이 이러한 신청에 대하여 승낙함으로써 체결됩니다.2."한국식품산업클러스터진흥원"은"가입신청자"의 회원가입 후 내부 승인 시 “서비스" 이용을 승낙함을 원칙으로 합니다. 다만, "한국식품산업클러스터진흥원"은 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.	
① 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우,
단"한국식품산업클러스터진흥원"의 회원 재가입 승낙을 얻은 경우에는 예외로 함.  ② 실명이 아니거나 타인의 명의를 이용한 경우  ③ 허위의 정보를 기재하거나, "한국식품산업클러스터진흥원"이 제시하는 내용을 기재하지 않은 경우  ④ 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
3.제1항에 따른 신청에 있어"한국식품산업클러스터진흥원"은"회원"의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.4."한국식품산업클러스터진흥원"은 서비스관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.5.제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, "한국식품산업클러스터진흥원"은 원칙적으로 이를 가입신청자에게 알리도록 합니다.6.이용계약의 성립 시기는"한국식품산업클러스터진흥원"이 가입완료를 신청절차 상에서 표시한 시점으로 합니다.7."한국식품산업클러스터진흥원"은"회원"에 대해 정책에 따라 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.
 
제5 조(회원정보의 변경)
1."회원"은 회원정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 아이디, 회원(기업)고유번호 등은 수정이 불가능합니다.2."회원"은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 전자우편 기타 방법으로"한국식품산업클러스터진흥원"에 대하여 그 변경사항을 알려야 합니다.3.제2항의 변경사항을"한국식품산업클러스터진흥원"에 알리지 않아 발생한 불이익에 대하여"한국식품산업클러스터진흥원"는 책임지지 않습니다.
 
제6 조(개인정보보호 의무)
"한국식품산업클러스터진흥원"는"정보통신망법" 등 관계 법령이 정하는 바에 따라
"회원"의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및"한국식품산업클러스터진흥원"의 개인정보취급방침이 적용됩니다. 다만, "한국식품산업클러스터진흥원"의 비즈니스플랫폼(B2B플랫폼 및 B2C쇼핑몰(푸드마켓)) 이외의 링크된 사이트에서는"한국식품산업클러스터진흥원"의 개인정보취급방침이 적용되지 않습니다.
 
제7 조("회원"의"아이디" 및"비밀번호"의 관리에 대한 의무)
1."회원"의"아이디"와"비밀번호"에 관한 관리책임은"회원"에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.2."한국식품산업클러스터진흥원"은"회원"의"아이디"가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나"한국식품산업클러스터진흥원" 및
"한국식품산업클러스터진흥원"의 운영자로 오인한 우려가 있는 경우, 해당"아이디"의 이용을 제한할 수 있습니다.3."회원"은"아이디" 및"비밀번호"가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시"한국식품산업클러스터진흥원"에 통지하고
"한국식품산업클러스터진흥원"의 안내에 따라야 합니다.4. 제3항의 경우에 해당"회원"이"한국식품산업클러스터진흥원"에 그 사실을 통지하지 않거나, 통지한 경우에도"한국식품산업클러스터진흥원"의 안내에 따르지 않아 발생한 불이익에 대하여"한국식품산업클러스터진흥원"은 책임지지 않습니다.
 
제8 조("회원"에 대한 통지)
1."한국식품산업클러스터진흥원"이"회원"에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 서비스 내 전자우편주소, 모바일 메시지 등으로 할 수 있습니다.2."한국식품산업클러스터진흥원"은"회원" 전체에 대한 통지의 경우7일 이상"한국식품산업클러스터진흥원"의 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.
 
제9 조("한국식품산업클러스터진흥원"의 의무)
1."한국식품산업클러스터진흥원"은 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로"서비스"를 제공하기 위하여 최선을 다하여 노력합니다.2."한국식품산업클러스터진흥원"은"회원"이 안전하게"서비스"를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보취급방침을 공시하고 준수합니다.3."한국식품산업클러스터진흥원"은 서비스이용과 관련하여 발생하는 이용자의 불만 또는 피해구제요청을 적절하게 처리할 수 있도록 필요한 인력 및 시스템을 구비합니다.4."한국식품산업클러스터진흥원"은 서비스이용과 관련하여“회원”으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. "회원"이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여\"회원"에게 처리과정 및 결과를 전달합니다.
 
제10 조("회원"의 의무)
1."회원"은 다음 행위를 하여서는 안 됩니다.①신청 또는 변경 시 허위내용의 등록  ②타인의 정보도용  ③"한국식품산업클러스터진흥원"가 게시한 정보의 변경  ④"한국식품산업클러스터진흥원"가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시  ⑤"한국식품산업클러스터진흥원"와 기타 제3자의 저작권 등 지적재산권에 대한 침해  ⑥"한국식품산업클러스터진흥원" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위  ⑦외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를"서비스"에 공개 또는 게시하는 행위  ⑧“한국식품산업클러스터진흥원”의 동의 없이 영리를 목적으로"서비스"를 사용하는 행위  ⑨기타 불법적이거나 부당한 행위
2."회원"은 관계법, 이 약관의 규정, 이용안내 및"서비스"와 관련하여 공지한 주의사항, "한국식품산업클러스터진흥원"이 통지하는 사항 등을 준수하여야 하며, 기타"한국식품산업클러스터진흥원"의 업무에 방해되는 행위를 하여서는 안 됩니다.
 
제11 조("서비스"의 제공 등)
1.“한국식품산업클러스터진흥원”은 회원에게 아래와 같은 서비스를 제공합니다.   
①상품소개  ②회원사 소개  ③게시판형 서비스  ④쇼케이스 및 상품담기
외 기타 추가 개발하거나 다른 회사와의 제휴계약 등을 통해"회원"에게 제공하는 일체의 서비스
2.“한국식품산업클러스터진흥원”은"서비스"를 이용가능 일시 및 시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.3."서비스"는 연중무휴, 1일24시간 제공함을 원칙으로 합니다.4."한국식품산업클러스터진흥원"은 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우"서비스"의 제공을 일시적으로 중단할 수 있습니다. 이 경우"한국식품산업클러스터진흥원"은"회원"에게 통지합니다. 다만, "한국식품산업클러스터진흥원"이 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.5."한국식품산업클러스터진흥원"은 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스 제공화면에 공지한 바에 따릅니다.6."한국식품산업클러스터진흥원"은 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부"서비스"를 변경할 수 있습니다.7."서비스"의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전에 해당 서비스 초기화면에 게시하여야 합니다.
 
제12 조(정보의 제공 및 광고의 게재)
1."한국식품산업클러스터진흥원"은"회원"이"서비스" 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편, SMS문자 등의 방법으로"회원"에게 제공할 수 있습니다. 다만, "회원"은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편 및SMS문자에 대해서 수신 거절을 할 수 있습니다.2. 제1항의 정보를 전송하려고 하는 경우에는"회원"의 사전 동의를 받아서 전송합니다. 다만, "회원"의 거래관련 정보 및 고객문의 등에 대한 회신에 있어서는 제외됩니다.
3. “한국식품산업클러스터진흥원”은 홈페이지에 게시된“회원”의 정보(이메일 주소, 연락처 등)가 전자우편수집프로그램이나 그 밖의 기술적 장치를 이용하여 무단으로 수집되는 것을 거부하며“회원” 이를 위반 시 정보통신망이용촉진 및 전보보호등에 관한 법률 제50조2(전자우편주소의 무단수집행위 등 금지)에 관한 법률에 의해 형사 처벌됩니다.
 
제13 조("게시물"의 저작권)
1."회원"이"서비스" 내에 게시한"게시물"의 저작권은 해당 게시물의 저작자에게 귀속됩니다.2.“한국식품산업클러스터진흥원”은 저작권법 규정을 준수하며, "회원"은 언제든지 고객센터 또는"서비스" 내 관리기능을 통해 해당 게시물에 대해 삭제, 비공개 등의 조치를 취할 수 있습니다.3.귀하의 게시물이 타인의 저작권을 침해함으로써 발생하는 민, 형사상의 책임은 전적으로 귀하가 부담하여야 합니다.
 
제14 조("게시물의 관리")
1."회원"의"게시물"이"정보통신망법" 및"저작권법"등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당"게시물"의 게시중단 및 삭제 등을 요청할 수 있으며, "한국식품산업클러스터진흥원"은 관련법에 따라 조치를 취하여야 합니다.2."한국식품산업클러스터진흥원"은 전항에 따른 권리자의 요청이 없는 경우라도권리침해가 인정될 만한 사유가 있거나 기타 한국식품산업클러스터진흥원 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당"게시물"에 대해 임시조치 등을 취할 수 있습니다.3.“한국식품산업클러스터진흥원”에 게시된 내용을 사전 통지 없이 편집, 이동할 수 있는 권리를 보유하며, 다음의 경우 사전 통지 없이 삭제할 수 있습니다.	
①본 서비스 약관에 위배되거나 상용 또는 불법, 음란, 저속하다고 판단되는 게시물을 게시한 경우  ②다른“회원” 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우  ③공공질서 및 미풍양속에 위반되는 내용인 경우  ④범죄적 행위에 결부된다고 인정되는 내용일 경우  ⑤제3자의 저작권 등 기타 권리를 침해하는 내용인 경우  ⑥기타 관계 법령에 위배되는 경우
제15 조(계약해제, 해지 등)
1."회원"은 언제든지 서비스초기화면의 고객센터 또는 회원탈퇴 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, "한국식품산업클러스터진흥원"은 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.2."회원"이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라"한국식품산업클러스터진흥원"가 회원정보를 보유하는 경우를 제외하고는 해지 즉시"회원"의 모든 데이터는 소멸됩니다.3."회원"이 계약을 해지하는 경우, "회원"이 작성한"게시물"일체는 삭제됩니다. 다만, 타인에 의해 담기, 스크랩 등이 되어 재게시되거나, 공용게시판에 등록된"게시물" 등은 삭제되지 않으니 사전에 삭제 신청 후 탈퇴하시기 바랍니다.
 
제16 조(이용제한 등)
1."한국식품산업클러스터진흥원"은"회원"이 이 약관의 의무를 위반하거나"서비스"의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로"서비스" 이용을 단계적으로 제한할 수 있습니다.2."한국식품산업클러스터진흥원"은 전항에도 불구하고, "주민등록법"을 위반한 명의도용 및 결제도용, "저작권법" 및"컴퓨터프로그램보호법"을 위반한 불법프로그램의 제공 및 운영방해, "정보통신망법"을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다.3."한국식품산업클러스터진흥원"은"회원"이 계속해서3개월 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.4.본 조에 따라"서비스" 이용을 제한하거나 계약을 해지하는 경우에는 반드시"회원"에게 통지합니다.5."회원"은 본 조에 따른 이용제한 등에 대해"한국식품산업클러스터진흥원"이 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고"한국식품산업클러스터진흥원"이 인정하는 경우 즉시"서비스"의 이용을 재개합니다.
 
제17 조(책임제한)
1."한국식품산업클러스터진흥원"은 천재지변 또는 이에 준하는 불가항력으로 인하여"서비스"를 제공할 수 없는 경우에는"서비스" 제공에 관한 책임이 면제됩니다.2."한국식품산업클러스터진흥원"은"회원"의 귀책사유로 인한"서비스" 이용의 장애에 대하여는 책임을 지지 않습니다.3."한국식품산업클러스터진흥원"은"회원"이"서비스"와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.4."한국식품산업클러스터진흥원"은"회원" 간 또는"회원"과 제3자 상호간에"서비스"를 매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다.5."한국식품산업클러스터진흥원"은 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.
 
제18 조(준거법 및 재판관할)
1."한국식품산업클러스터진흥원"과"회원" 간 제기된 소송은 대한민국법을 준거법으로 합니다.2.본 서비스 이용과 관련하여 발생한 분쟁에 대해 소송이 제기될 경우 중소기업유통센터 소재지를 관할하는 법원을 관할 법원으로 합니다.
`;

  const secondPolicy = `한국식품산업클러스터진흥원 개인정보처리방침
한국식품산업클러스터진흥원은 사용자의 소중한 정보 보호를 위해 관련 법률을 준수하고 있습니다.
한국식품산업클러스터진흥원이 취급하는 모든 개인정보는 관련법령에 근거하거나 정보주체의 동의에 의하여 수집·보유 및 처리되고 있습니다.
한국식품산업클러스터진흥원은 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리 방침을 두고 있습니다. 특히, 개인정보를 처리하는 본 운영업체의 경우『개인정보 보호법』제30조 제1항 및 동법『시행령』제31조 제1항의 규정에 의하여 해당 플랫폼에 별도의『개인정보처리방침』을 정하여 운영하고 있습니다. 한국식품산업클러스터진흥원은 개인정보처리방침을 변경하는 경우에는 시행의 시기, 변경된 내용을 정보주체가 쉽게 확인 할 수 있도록 변경 전·후를 비교하여 공개하도록 할 예정입니다.
가. 개인정보의 처리목적, 개인정보의 처리 및 보유기간, 처리하는 개인정보의 항목
법령에 의하여 수집‧이용되는 회원 정보
나. 개인정보의 제3자 제공
한국식품산업클러스터진흥원은 원칙적으로 정보주체의 개인정보를 수집·이용 목적으로 명시한 범위 내에서 처리하며, 다음의 경우를 제외하고는 정보주체의 사전 동의 없이는 본래의 목적 범위를 초과하여 처리하거나 제3자에게 제공하지 않습니다.
1. 정보주체로부터 별도의 동의를 받는 경우
2. 법률에 특별한 규정이 있는 경우
3. 정보주체 또는 법정대리인이 의사표시를 할 수 없는 상태에 있거나 주소불명 등으로 사전 동의를 받을 수 없는 경우로서 명백히 정보주체 또는 제3자의 급박한 생명, 신체, 재산의 이익을 위하여 필요하다고 인정되는 경우
4. 통계작성 및 학술연구 등의 목적을 위하여 필요한 경우로서 특정 개인을 알아 볼 수 없는 형태로 개인정보를 제공하는 경우
5. 개인정보를 목적 외의 용도로 이용하거나 이를 제3자에게 제공하지 아니하면 다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우로서 보호위원회의 심의·의결을 거친 경우
6. 조약, 그 밖의 국제협정의 이행을 위하여 외국정보 또는 국제기구에 제공하기 위하여 필요한 경우
7. 범죄의 수사와 공소의 제기 및 유지를 위하여 필요한 경우
8. 법원의 재판업무 수행을 위하여 필요한 경우
9. 형 및 감호, 보호처분의 집행을 위하여 필요한 경우
개인정보 제3자 제공 현황[별첨1]
[별첨1] 개인정보 제3자 제공현황
* 서비스제공기간: 관계법령의 규정에 의하여 보존할 필요가 있는 경우 및 사전 동의를 득한 경우 해당 보유 기간
다. 개인정보처리 위탁
1. 한국식품산업클러스터진흥원은 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
2. 한국식품산업클러스터진흥원은 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 재위탁하고 있습니다.
3. 한국식품산업클러스터진흥원은 위탁계약 시 개인정보 보호 관련 법규의 준수, 개인정보에 관한3자 제공 금지 및 책임부담 등을 명확히 규정하여 계약내용을 보관하고 있으며, 업체 변경 시 공지사항 및 개인정보 처리방침을 통해 고지하겠습니다.
라. 개인정보 자동 수집 장치의 설치․운영 및 그 거부에 관한 사항
1. 한국식품산업클러스터진흥원은 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용합니다.
2. 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자의PC 컴퓨터내의 하드디스크에 저장되기도 합니다.
1) 쿠키의 사용목적: 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.
2) 쿠키의 설치∙운영 및 거부: 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다.
3) 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.
마. 정보주체의 권리·의무 및 그 행사방법
정보주체는 다음과 같은 권리를 행사 할 수 있으며, 만14세 미만 아동의 법정대리인은 그 아동의 개인정보에 대한 열람, 정정·삭제, 처리정지를 요구할 수 있습니다.
- 개인정보 열람 청구 한국식품산업클러스터진흥원에서 보유하고 있는 개인정보파일은「개인정보보호법」제35조(개인정보의 열람)에 따라 자신의 개인정보에 대한 열람을 요구할 수 있습니다. 다만, 개인정보 열람 요구는 법 제35조5항에 의하여 다음과 같이 제한될 수 있습니다.
1. 법률에 따라 열람이 금지되거나 제한되는 경우
2. 다른 사람의 생명·신체를 해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 경우
3. 공공기관이 다음 각 목의 어느 하나에 해당하는 업무를 수행할 때 중대한 지장을 초래하는 경우
1) 조세의 부과·징수 또는 환급에 관한 업무
2)「초·중등교육법」및「고등교육법」에 따른 각급학교,「평생교육법」에 따른 평생교육시설, 그 밖의 다른 법률에 따라 설치 된 고등교육 기관에서의 성적 평가 또는 입학자 선발에 관한 업무
3) 학력·기능 및 채용에 관한 시험, 자격 심사에 관한 업무
4) 보상금·급부금 산정 등에 대하여 진행 중인 평가 또는 판단에 관한 업무
5) 다른 법률에 따라 진행 중인 감사 및 조사에 관한 업무
- 개인정보 정정 및 삭제 요구 한국식품산업클러스터진흥원에서 보유하고 있는 개인정보파일은「개인정보보호법」제36조(개인정보의 정정·삭제)에 따라 정정·삭제를 요구할 수 있습니다. 다만, 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우 에는 그 삭제를 요구할 수 없습니다.
- 개인정보 처리정지 요구 한국식품산업클러스터진흥원에서 보유하고 있는 개인정보파일은 「개인정보보호법」제37조(개인정보의 처리정지 등)에 따라 처리정지를 요구할 수 있습니다. 다만, 개인정보 처리정지 요구 시 법 제37조2항에 의하여 처리정지 요구가 거절될 수 있습니다.
1. 법률에 특별한 규정이 있거나 법령상 의무를 준수하기 위하여 불가피한 경우
2. 다른 사람의 생명·신체를 해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 경우
3. 공공기관이 개인정보를 처리하지 아니하면 다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우
4. 개인정보를 처리하지 아니하면 정보주체와 약정한 서비스를 제공하지 못하는 등 계약의 이행이 곤란한 경우로서 정보주체가 그 계약의 해지 의사를 명확하게 밝히지 아니한 경우
- 개인정보 열람 청구 등을 접수 및 처리하는 부서 한국식품산업클러스터진흥원 위탁시스템별 처리하는 개인정보에 대한 개인정보 열람청구, 정정·삭제, 처리정지를 위한 부서 및 담당자 연락처는 아래와 같습니다. · 개인정보처리시스템, 플랫폼 및 쇼핑몰 담당: 한국식품산업클러스터진흥원- 담당자: 오나나 차장- 연락처: 063-720-0576, nana@foodpolis.kr · 운영 및 c/s 담당: 운영 위탁업체 (주)논다 - 담당자: 박종석 차장- 연락처: 070-495-2887, pjs9681@non-da.com
바. 개인정보의 파기
한국식품산업클러스터진흥원은 원칙적으로 개인정보 처리목적이 달성된 개인정보는 지체 없이 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.
1. 파기 절차 개인정보는 목적 달성 후 즉시 또는 별도의 공간에 옮겨져 내부 방침 및 기타 관련법령에 따라 일정기간 저장된 후 파기됩니다. 별도의 공간으로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.
2. 파기 기한 및 파기 방법 보유기간이 만료되었거나 개인정보의 처리목적달성, 해당 업무의 폐지 등 그 개인정보가 불필요하게 되었을 때에는 지체 없이 파기합니다. 전자적 파일형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.
사. 개인정보의 안전성 확보 조치
1. 개인정보 취급직원의 최소화 및 교육 개인정보를 취급하는 직원은 반드시 필요한 인원에 한하여 지정· 관리하고 있으며 취급직원을 대상으로 안전한 관리를 위한 교육을 실시하고 있습니다.
2. 개인정보에 대한 접근 제한 개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여·변경·말소를 통하여 개인정보에 대한 접근통제를 위한 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
3. 접속기록의 보관 개인정보처리시스템에 접속한 기록(웹 로그, 요약정보 등)을 최소6개월 이상 보관·관리하고 있습니다.
4. 개인정보의 암호화 개인정보는 암호화 등을 통해 안전하게 저장 및 관리되고 있습니다. 또한 중요한 데이터는 저장 및 전송 시 암호화하여 사용하는 등의 별도 보안기능을 사용하고 있습니다.
5. 보안프로그램 설치 및 주기적 점검·갱신 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적으로 갱신·점검하고 있습니다.
6. 비인가자에 대한 출입 통제 개인정보를 보관하고 있는 개인정보시스템의 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
아. 타기관(업체) 웹페이지 이동 시
한국식품산업클러스터진흥원가 운영하는 여러 웹페이지에 포함된 링크 또는 배너를 클릭하여 다른 사이트 또는 웹페이지로 옮겨갈 경우 개인정보처리방침은 그 사이트 운영기관이 게시한 방침이 적용되므로 새로 방문한 사이트의 방침을 확인하시기 바랍니다.
자. 웹사이트 이용 중 다른 사람의 개인정보 취득 금지
한국식품산업클러스터진흥원가 운영하는 웹사이트에서 이메일 주소 등 식별할 수 있는 개인정보를 취득하여서는 안됩니다. 기타 부정한 방법으로 이러한 개인정보를 열람 또는 제공받은 자는 관계 법규에 의하여 처벌을 받을 수 있습니다.
차. 권인침해 구제방법
개인정보주체는 개인정보침해로 인한 피해를 구제 받기 위하여 개인정보 분쟁조정위원회, 한국인터넷진흥원 개인정보 침해-신고 센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다.
- 개인정보 분쟁조정위원회: 1833-6972(www.kopico.go.kr)
- 개인정보침해신고센터: (국번없이) 118 (privacy.kisa.or.kr)
- 대검찰청 사이버범죄수사단: 02-3480-3571(cybercid@spo.go.kr)
- 경찰청 사이버안전국: (국번없이) 182 (cyberbureau.police.go.kr)
또한, 개인정보의 열람, 정정·삭제, 처리정지 등에 대한 정보주체자의 요구에 대하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익을 침해 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
- 중앙행정심판위원회(www.simpan.go.kr)의 전화번호 안내 참조
카. 개인정보 보호책임자 및 담당자 연락처
개인정보주체는 개인정보침해로 인한 피해를 구제 받기 위하여 개인정보 분쟁조정위원회, 한국인터넷진흥원 개인정보 침해-신고 센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다.
1) 담당기관- 담당기관명: 한국식품산업클러스터진흥원- 개인정보 보호책임자: 오나나 차장
2) 위탁처리 기관- 위탁기관명: (주)논다- 주소: 광주광역시 북구 첨단연신로 88, 1008 - 개인정보 보호책임자: 박종석 차장- 개인정보 보호담당자
o – 박종석 차장
o – 연락처: 070-4895-2887, pjs9681@non-da.com
타. 개인정보 침해신고 처리 절차
1. 침해신고 접수: 해당기관 온라인 플랫폼 또는 쇼핑몰을 통한 접수
2. 침해사실 조사: 침해여부 확인, 침해기관 방문 및 서면조사
3. 처리: 조치보고서를 통한 처리 및 조치
4. 결과통보: 신고인 및 행안부 통보
파. 개인정보 처리방침 변경
1. 이 개인정보 처리방침은2021년 07월 21일부터 적용됩니다.
[별첨2]한국식품산업클러스터진흥원 재위탁 현황 
`;

  const router = useRouter();
  const [policy1, setPolicy1] = useState(false);
  const [policy2, setPolicy2] = useState(false);

  return (
    <div className="flex w-full flex-col items-center justify-center">
      <Card className="w-full border bg-secondary/5 p-8 shadow md:w-2/3">
        {/* Logo */}
        <div className="justify-left mb-4 flex items-center gap-3">
          <AppLogo href={HOME_URL} className="w-28 md:w-32" />
          <div className="flex flex-col text-left">
            <p className="text-default-800 text-lg font-semibold">
              Customized Dietary
            </p>
            <p className="text-default-500 text-sm">맞춤형 식이 설계</p>
          </div>
        </div>
        <span className="text-xl font-bold">서비스 이용약관</span>
        <Textarea
          className="mt-2 h-32 w-full resize-none border bg-white text-sm"
          value={firstPolicy}
          readOnly
        />
        <div className="mb-4 mt-4 flex items-center justify-end gap-2">
          <Checkbox
            checked={policy1}
            id="terms1"
            onCheckedChange={() => setPolicy1(!policy1)}
          />
          <label className="cursor-pointer" htmlFor="terms1">
            이용 약관 동의 (필수)
          </label>
        </div>
        <span className="text-xl font-bold">개인정보 수집 및 이용</span>
        <Textarea
          className="mt-2 h-32 w-full resize-none border bg-white text-sm"
          value={secondPolicy}
          readOnly
        />
        <div className="mt-4 flex items-center justify-end gap-2">
          <Checkbox
            checked={policy2}
            id="terms2"
            onCheckedChange={() => setPolicy2(!policy2)}
          />
          <label className="cursor-pointer" htmlFor="terms2">
            개인정보 수집 · 이용 동의 (필수)
          </label>
        </div>
        <div className="flex w-full items-center justify-center gap-5 pt-4 md:gap-10">
          <Button
            className="w-1/2 rounded-lg md:w-1/3"
            onClick={() => router.push(REGISTER_URL)}
            disabled={!(policy1 && policy2)}
          >
            동의 후 진행
          </Button>
          <Button
            className="w-1/2 rounded-lg md:w-1/3"
            variant="blue"
            onClick={() => router.push(LOGIN_USER_URL)}
          >
            미동의
          </Button>
        </div>
      </Card>
    </div>
  );
};

export default PolicyForm;
